let countries = ["Австралия", "Австрия", "Азербайджан", "Албания", "Алжир",
 				"Ангола", "Андорра", "Антигуа и Барбуда", "Антильские острова", 
 				"Аргентина", "Армения", "Афганистан", "Багамские острова", "Бангладеш", 
 				"Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", "Бенин", "Болгария",
 				"Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Буркина-Фасо",
 				"Бурунди", "Бутан", "Вануату", "Ватикан", "Великобритания", "Венгрия",
 				"Венесуэла", "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана",
 				"Гватемала", "Гвинея", "Гвинея-Бисау", "Германия", "Голландия", "Гондурас",
 				"Гонконг", "Гренада", "Гренландия", "Греция", "Грузия", "Гуам", "Дания",
 				"Демократическая Республика Конго", "Джибути", "Доминиканская республика",
 				"Египет", "Замбия", "Западная Сахара", "Зимбабве", "Израиль", "Индия",
 				"Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия", "Испания",
 				"Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун",
 				"Канада", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай",
 				"КНДР", "Колумбия", "Коморские острова", "Коста-Рика", "Кот-д'Ивуар",
 				"Куба", "Кувейт", "Лаос", "Латвия", "Лесото", "Либерия", "Ливан",
 				"Ливия", "Литва", "Лихтенштейн", "Люксембург", "Маврикий", "Мавритания",
 				"Мадагаскар", "Македония", "Малави", "Малайзия", "Мали", "Мальдивы", "Мальта",
 				"Марокко", "Мартиника", "Мексика", "Микронезия", "Мозамбик", "Молдавия", "Монако",
 				"Монголия", "Мьянма", "Намибия", "Непал", "Нигер", "Нигерия", "Никарагуа",
 				"Новая Зеландия", "Новая Каледония", "Норвегия", "ОАЭ", "Оман", "Пакистан", 
 				"Палестина", "Панама", "Папуа-Новая Гвинея", "Парагвай", "Перу", "Польша", 
 				"Португалия", "Пуэрто-Рико", "Республика Конго", "Республика Корея", "Россия", 
 				"Руанда", "Румыния", "Сальвадор", "Сан-Марино", "Сан-Томе и Принсипи", 
 				"Саудовская Аравия", "Свазиленд", "Сенегал", "Сент-Китс и Невис", "Сент-Люсия", 
 				"Сербия", "Сингапур", "Сирия", "Словакия", "Словения", "Соломоновы острова", "Сомали",
 				"Судан", "Суринам", "США", "Сьерра-Леоне", "Таджикистан", "Таиланд", "Тайвань", 
 				"Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тунис", "Туркменистан", "Турция", 
 				"Уганда", "Узбекистан", "Украина", "Уругвай", "Фиджи", "Филиппины", "Финляндия", 
 				"Франция", "Французская Гвиана", "Хорватия", "Центральноафриканская Республика", "Чад", 
 				"Черногория", "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", 
 				"Экваториальная Гвинея", "Эритрея", "Эстония", "Эфиопия", "ЮАР", "Ямайка", "Япония"];


let inputField = document.getElementsByTagName('input')[0];
let hintListUl = document.getElementById('list');


inputField.addEventListener('keyup', function(event){

	let target = event.target;
	let reg = new RegExp('^'+ target.value, 'i');	
	hintListUl.style.visibility = 'hidden';

	if(target.value.length > 0){
		removeChildren();
		for(let i = 0; i < countries.length; i++){
			if(reg.test(countries[i])){
				hintListUl.style.visibility = "visible";
				createNewElement(countries[i]);
			}
		}
	}


	hintListUl.addEventListener('click', function(typeElem){
			let targetLi = typeElem.target;
			target.value = targetLi.innerHTML;
			removeChildren();
	});
	/*Обработчик для добавления выбранного значения из списка подсказок в поле inputField*/
});


function createNewElement(hintContent){
	let hint = document.createElement('li');
	hint.style.listStyleType = 'none';
	hint.textContent = hintContent;
	hintListUl.appendChild(hint);
}
/*Добавляем элемент списка в hintListUl*/

function removeChildren(){
	while (hintListUl.firstChild) {
    	hintListUl.removeChild(hintListUl.firstChild);
	}
}
/*Удаляем всех потомков hintListUl*/